In [13]:
import pandas as pd 
import numpy as np
from matplotlib import pyplot as plt

In [14]:
import seaborn as sns
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
df['class'].unique()

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

In [16]:
df=df[['survived','pclass','sex','embarked','alone']]

In [17]:
df.head()

   survived  pclass     sex embarked  alone
0         0       3    male        S  False
1         1       1  female        C  False
2         1       3  female        S   True
3         1       1  female        S  False
4         0       3    male        S   True

In [18]:
## here we need to perform  label encoding before using chi2

In [19]:
df['sex']=np.where(df['sex']=='male',1,0)
df.head()

   survived  pclass  sex embarked  alone
0         0       3    1        S  False
1         1       1    0        C  False
2         1       3    0        S   True
3         1       1    0        S  False
4         0       3    1        S   True

In [21]:
ordinal_label={k:i for i ,k in enumerate(df["embarked"].unique(),0)}

In [22]:
df['embarked']=df['embarked'].map(ordinal_label)

In [23]:
df.head()

   survived  pclass  sex  embarked  alone
0         0       3    1         0  False
1         1       1    0         1  False
2         1       3    0         0   True
3         1       1    0         0  False
4         0       3    1         0   True

In [25]:
df['alone']=np.where(df['alone']==True,1,0)
df.head()

   survived  pclass  sex  embarked  alone
0         0       3    1         0      0
1         1       1    0         1      0
2         1       3    0         0      1
3         1       1    0         0      0
4         0       3    1         0      1

In [26]:
## TRAIN TEST SPLIT TO AVOID OVERFITTING

In [27]:
x=df.drop(labels=['survived'],axis=1)

In [28]:
y=df['survived']

In [29]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,train_size=0.7,test_size=0.3,random_state=0)

In [30]:
x_train.head()

     pclass  sex  embarked  alone
857       1    1         0      1
52        1    0         1      0
386       3    1         0      0
124       1    1         0      0
578       3    0         1      0

In [31]:
x_train.isnull().sum()

pclass      0
sex         0
embarked    0
alone       0
dtype: int64

### performing chi2 test

In [32]:
from sklearn.feature_selection import chi2

In [33]:
f_p_values=chi2(x_train,y_train)
f_p_values

(array([21.61080949, 63.55447864, 11.83961845,  9.03328564]),
 array([3.33964360e-06, 1.55992554e-15, 5.79837058e-04, 2.65107556e-03]))

In [34]:
p_values=pd.Series(f_p_values[1])

In [35]:
p_values.index=x_train.columns
p_values

pclass      3.339644e-06
sex         1.559926e-15
embarked    5.798371e-04
alone       2.651076e-03
dtype: float64

In [37]:
p_values.sort_values(ascending=True)

sex         1.559926e-15
pclass      3.339644e-06
embarked    5.798371e-04
alone       2.651076e-03
dtype: float64

Here sex is is most important feature because we know lesser the p values higher the importance